{
    "flares": [
        {
            "type": "Flare",
            "upgraded": "You may do up to 3 standard moves, using your common pieces.",
            "pieces": "Gain an action."
        }
    ],
    "legends": [
        {
            "type": "Legends",
            "name": "Storm Elemental",
            "text": "You may place 1 piece of your color on an empty square up to distance 3. With it, do up to 1 (if legendary), 3 (if heroic), or 5 (if common) combat moves in one direction. Then destroy it."
        },
        {
            "type": "Legends",
            "name": "Fire Dragon",
            "text": "Choose one of the indicated directions: Destroy all non-legendary pieces up to distance 2 in that direction and in both directions at 45 degrees to it."
        }
    ],
    "faction_cards": [
        {
            "type": "Sylvan",
            "name": "Forest Ancient",
            "text": "Place 2 enemy common pieces on empty squares up to distance 2. Then destroy 2 common pieces of the same color or colors up to distance 3."
        },
        {
            "type": "Sylvan",
            "name": "Sylvan Princess",
            "text": "You may convert 1 common enemy piece on a diagonally adjacent square to your common piece."
        },
        {
            "type": "Sylvan",
            "name": "Tree Shepherd",
            "text": "Choose 1 of your pieces: If it is common, upgrade it; if heroic, it may do 1 combat move; if legendary, it may do 1 standard move."
        }
    ],
    "tasks": [
        {
            "type": "task",
            "name": "Green Conquest",
            "text": "You have at least 3 pieces on green squares, and at least 2 of them are upgraded."
        },
        {
            "type": "task",
            "name": "Red Conquest",
            "text": "You have at least 3 pieces on red squares, and at least 2 of them are upgraded."
        },
        {
            "type": "task",
            "name": "Central Dominance",
            "text": "You have at least 5 pieces on the nine central squares, and at least 2 of them are upgraded."
        },
        {
            "type": "task",
            "name": "Envelopment",
            "text": "You have at least 7 pieces adjacent to the same enemy piece."
        }
    ]
}